tasks = [
    {
        'task': 'Кто автор произведения "Война и мир"?',
        'options': (
            'Лев Толстой', 
            'Фёдор Достоевский', 
            'Александр Пушкин', 
            'Николай Гоголь', 
            'Михаил Лермонтов'
        ),
        'difficulty': 2,
        'hint': 'Этот писатель имел титул графа.'
    },
    {
        'task': 'Кто был первым президентом Российской Федерации?',
        'options': (
            'Михаил Горбачёв', 
            'Борис Ельцин', 
            'Никита Хрущёв'
        ),
        'difficulty': 3,
        'hint': 'Этот человек возглавлял РСФСР.'
    },
    {
        'task': 'В каком городе расположен Кремль?',
        'options': (
            'Новосибирск', 
            'Санкт-Петербург', 
            'Москва', 
            'Казань'
        ),
        'difficulty': 1,
        'hint': 'Это столица России.'
    },
    {
        'task': 'Чем знаменателен 1812-й год в истории России?',
        'options': (
            'Отмена крепостного права', 
            'Восшествие на престол Александра I', 
            'Война с Наполеоном', 
            'Вступление в ВТО',
            'Восстание декабристов'
        ),
        'difficulty': 2,
        'hint': 'В это время Россия воевала с Францией.'
    },
    {
        'task': 'Какое море не омывает берега России?',
        'options': (
            'Чёрное море', 
            'Балтийское море', 
            'Каспийское море', 
            'Средиземное море', 
            'Японское море', 
            'Азовское море'
        ),
        'difficulty': 3,
        'hint': 'Это море омывает берега Южной Европы и Северной Африки.'
    },
]